laszloh/esp8266-temperature/Software/esp8266-temperature/src/main.cpp
/**
 * @file main.cpp
 * @author Laszlo Hegedüs (laszlo.hegedues@gmail.com)
 * @brief 
 * @version 0.1
 * @date 2020-09-30
 * 
 * \copyright Copyright (c) 2020 under the MIT License
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_BME280.h>
#include <ArduinoLog.h>

#include "rtc.h"
#include "settings.h"
#include "setup_ap.h"
#include "mqtt_client.h"

#define LOG_AS  "[MAIN] "

static constexpr uint32_t timeout = ESP_WIFI_TIMEOUT;     //< wifi connect timeout
static constexpr uint32_t sleep_time = 15*60*1000*1000;   //< deep sleep time in us
//constexpr uint32_t sleep_time = 5*1000*1000;     //< deep sleep time in us

constexpr const char *mqtt_server = "192.168.88.12";

static Adafruit_BME280 bme;
static MqttClient client;
static RtcMemory rtc = RtcMemory::getInstance();

static uint32_t boot_time;

ADC_MODE(ADC_VCC)

// preinit() is called before system startup
// from nonos-sdk's user entry point user_init()

RF_PRE_INIT()
{
    system_phy_set_powerup_option(2);
}

void preinit() {
  // Global WiFi constructors are not called yet
  // (global class instances like WiFi, Serial... 
  // are not yet initialized)..
  // No global object methods or C++ exceptions
  // can be called in here!
  // The code line below is a static class method, 
  // which is similar to a function, so it's ok.
  ESP8266WiFiClass::preinitWiFiOff();
}

void enter_sleep(void) {
    uint32_t curTime;

    Log.notice(F(LOG_AS "Going to deep sleep" CR));
    curTime = millis()-boot_time;
    rtc.setLastWakeDuration(curTime);
    rtc.WriteRtcMemory();
    Log.verbose(F(LOG_AS "Was awake for %l ms" CR), curTime);
    Serial.flush();
    ESP.deepSleepInstant(sleep_time, WAKE_NO_RFCAL);
    delay(10);
}

void setup() {
    float temp, pressure, humidity;
    uint16_t curTime;
    settings_t sett;

    system_update_cpu_freq(160);
    randomSeed(analogRead(0));

    boot_time = millis();

    Serial.begin(74880);
    while(!Serial);

    Log.begin(LOG_LEVEL_VERBOSE, &Serial);

    Log.notice(F(LOG_AS "ESP8266 startup..." CR));

    pinMode(D0, WAKEUP_PULLUP);

    // load config from EEPROM
    if(!loadConfig(sett)) {
        // if we fail to load the settings, launch AP
        if(!setup_ap(sett)) {
            // setup AP timed out
            Log.error(F(LOG_AS "Setup AP timed out. Going to forced sleep."));
            enter_sleep();
        }
    }

    // boot up the wifi to send the data
    if(rtc.isRtcValid()) {
        Log.notice(F(LOG_AS "RTC config: found" CR));
        WiFi.forceSleepWake();
        WiFi.config(rtc.getIp(), rtc.getGateway(), rtc.getMask(), rtc.getDns());
        uint8_t bssid[6];
        rtc.getBssid(bssid);
        WiFi.begin(sett.data.wifi_ssid, sett.data.wifi_pwd, rtc.getChannel(), bssid);
    } else {
        // no data in rtc, normal startup
        Log.notice(F(LOG_AS "RTC config: NOT found" CR));
        WiFi.forceSleepWake();
        WiFi.begin(sett.data.wifi_ssid, sett.data.wifi_pwd);
    }

    // boot up the BME280
    bool status = bme.begin(BME280_ADDRESS_ALTERNATE);
    if(!status) {
        Log.error(F(LOG_AS "Could not find a valid BME280 sensor, check wiring, address, sensor ID!" CR));
        Log.error(F(LOG_AS "SensorID was: %X" CR), bme.sensorID());
        enter_sleep();
    }
    bme.setSampling(Adafruit_BME280::MODE_FORCED,
                    Adafruit_BME280::SAMPLING_X1, // temperature
                    Adafruit_BME280::SAMPLING_X1, // pressure
                    Adafruit_BME280::SAMPLING_X1, // humidity
                    Adafruit_BME280::FILTER_OFF);
    bme.takeForcedMeasurement();
    pressure = bme.readPressure();
    Log.verbose(F(LOG_AS "Current Pressure: %l" CR), pressure);
    humidity = bme.readHumidity();
    Log.verbose(F(LOG_AS "Current Humidity: %l" CR), (uint16_t)(humidity*100));
    temp = bme.readTemperature();
    Log.verbose(F(LOG_AS "Current Temperature: %l" CR), (uint16_t)(temp*100));

    uint32_t cur_ms = millis();
    while (WiFi.status() != WL_CONNECTED) {
        if(millis() - cur_ms > timeout) {
            Log.error(F(LOG_AS "Could not connect to WiFi..." CR));
            curTime = millis()-boot_time;
            Log.error(F(LOG_AS "Giving up at %l ms" CR), curTime);
            Log.error(F(LOG_AS "going to forced sleep... CR"));
            enter_sleep();
        }
        delay(10);
    }
    curTime = millis()-boot_time;
    Log.verbose(F(LOG_AS "Connect at %l ms" CR), curTime);

    station_config wifi_conf;
    wifi_station_get_config(&wifi_conf);
    rtc.setBssid(wifi_conf.bssid);
    rtc.setChannel(wifi_get_channel());
    rtc.setIp(WiFi.localIP());
    rtc.setGateway(WiFi.gatewayIP());
    rtc.setMask(WiFi.subnetMask());
    rtc.setDns(WiFi.dnsIP());
    rtc.WriteRtcMemory();

    // Start the MQTT party
    client.begin(sett);
    if(client.connect()) {
        uint16_t vcc = ESP.getVcc();
        client.sendMeasurment(temp, humidity, pressure);
        client.sendStatus(WiFi.RSSI(), vcc);
    }
    enter_sleep();
}

void loop() {
    // if we got here, goto sleep
    enter_sleep();
}
